Autodesk.Revit.DB.WallCrossSection
The allowed values for the WALL_CROSS_SECTION parameter.

Autodesk.Revit.DB.WallCrossSection.Tapered
A tapered wall whose angle is controlled by the parameters
WALL_TAPERED_EXTERIOR_INWARD_ANGLE and WALL_TAPERED_INTERIOR_INWARD_ANGLE.

Autodesk.Revit.DB.WallCrossSection.SingleSlanted
A single-slanted wall whose angle is controlled by the parameter WALL_SINGLE_SLANT_ANGLE_FROM_VERTICAL.

Autodesk.Revit.DB.WallCrossSection.Vertical
A vertical wall, 0 degrees.